EDT/ZUP/zup_edt/src/Documents/ПодготовкаСпецоценкиУсловийТруда/ПодготовкаСпецоценкиУсловийТруда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПодготовкаСпецоценкиУсловийТруда</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПодписиРуководителя</name>
    <type>
      <types>DefinedType.ОснованиеПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаОхрануТруда</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьОтветственногоЗаОхрануТруда</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПодписиОтветственногоЗаОхрануТруда</name>
    <type>
      <types>DefinedType.ОснованиеПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РабочиеМеста</name>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.ШтатноеРасписание</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРабочегоМеста</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлассУсловийТрудаПоРезультатамПредыдущейОценки</name>
      <type>
        <types>EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПредыдущейОценки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АналогичныеМеста</name>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.ШтатноеРасписание</types>
      </type>
    </attributes>
    <attributes>
      <name>АналогичноеМесто</name>
      <type>
        <types>DefinedType.УсловияТруда</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.ШтатноеРасписание</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СтраховойНомерПФР</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пол</name>
      <type>
        <types>EnumRef.ПолФизическогоЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Инвалидность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комиссия</name>
    <attributes>
      <name>ЧленКомиссии</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РольВКомиссии</name>
      <type>
        <types>EnumRef.РолиЧленовКомиссииОхраныТруда</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФизическиеЛица</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/ZUP/zup_edt/src/Documents/ПодготовкаСпецоценкиУсловийТруда/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаНачала, "Объект.ДатаНачала", Отказ, НСтр("ru='Дата начала'"), , , Ложь);
	
	КоличествоЧленовКомиссии = Комиссия.Количество();
	
	Если КоличествоЧленовКомиссии = 0 Тогда
		ТекстОшибки = НСтр("ru = 'Не заполнен состав комиссии.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , "Объект", Отказ);
	Иначе
		Если Цел(КоличествоЧленовКомиссии/2) = КоличествоЧленовКомиссии/2 Тогда
			ТекстОшибки = НСтр("ru = 'Количество членов комиссии должно быть нечетным.'");
			Поле = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Комиссия[%1].%2", Комиссия.Количество()-1, "НомерСтроки");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , Поле, "Объект", Отказ);
		КонецЕсли;
	КонецЕсли;
	
	КоличествоПредседателей = 0;
	Для каждого СтрокаКомиссии Из Комиссия Цикл
		Если СтрокаКомиссии.РольВКомиссии = Перечисления.РолиЧленовКомиссииОхраныТруда.Председатель Тогда
			КоличествоПредседателей = КоличествоПредседателей + 1;
		КонецЕсли;
	КонецЦикла;
	Если КоличествоПредседателей > 1 Тогда
		ТекстОшибки = НСтр("ru = 'Председатель в комиссии должен быть один.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , "Объект", Отказ);
	ИначеЕсли КоличествоПредседателей = 0 Тогда
		ТекстОшибки = НСтр("ru = 'Не указан председатель комиссии.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , "Объект", Отказ);
	КонецЕсли;
	
	Если ДатаНачала > ДатаОкончания Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Дата окончания не может быть меньше даты начала проведения спецоценки условий труда'"), ЭтотОбъект, "ДатаОкончания", ,Отказ);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РабочиеМеста", РабочиеМеста.Выгрузить());
	Запрос.УстановитьПараметр("АналогичныеМеста", АналогичныеМеста.Выгрузить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РабочиеМеста.РабочееМесто,
	|	РабочиеМеста.НомерСтроки,
	|	РабочиеМеста.ПредставлениеРабочегоМеста
	|ПОМЕСТИТЬ ВТРабочиеМеста
	|ИЗ
	|	&РабочиеМеста КАК РабочиеМеста
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АналогичныеМеста.РабочееМесто,
	|	АналогичныеМеста.АналогичноеМесто
	|ПОМЕСТИТЬ ВТАналогичныеМеста
	|ИЗ
	|	&АналогичныеМеста КАК АналогичныеМеста
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РабочиеМеста.РабочееМесто,
	|	РабочиеМеста.НомерСтроки,
	|	РабочиеМеста.АналогичноеМесто,
	|	РабочиеМеста.ГруппаАналогичныхМест
	|ИЗ
	|	(ВЫБРАТЬ
	|		РабочиеМеста.РабочееМесто КАК РабочееМесто,
	|		РабочиеМеста.НомерСтроки КАК НомерСтроки,
	|		ЛОЖЬ КАК АналогичноеМесто,
	|		НЕОПРЕДЕЛЕНО КАК ГруппаАналогичныхМест
	|	ИЗ
	|		ВТРабочиеМеста КАК РабочиеМеста
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРабочиеМеста КАК РабочиеМестаДубль
	|			ПО РабочиеМеста.РабочееМесто = РабочиеМестаДубль.РабочееМесто
	|				И РабочиеМеста.НомерСтроки <> РабочиеМестаДубль.НомерСтроки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РабочиеМеста.РабочееМесто,
	|		РабочиеМеста.НомерСтроки,
	|		ИСТИНА,
	|		ПредставленияРабочихМест.ПредставлениеРабочегоМеста
	|	ИЗ
	|		ВТРабочиеМеста КАК РабочиеМеста
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналогичныеМеста КАК АналогичныеМеста
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТРабочиеМеста КАК ПредставленияРабочихМест
	|				ПО АналогичныеМеста.РабочееМесто = ПредставленияРабочихМест.РабочееМесто
	|			ПО РабочиеМеста.РабочееМесто = АналогичныеМеста.АналогичноеМесто) КАК РабочиеМеста
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочиеМеста.РабочееМесто,
	|	РабочиеМеста.НомерСтроки,
	|	РабочиеМеста.АналогичноеМесто,
	|	РабочиеМеста.ГруппаАналогичныхМест
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочиеМеста.РабочееМесто";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("РабочееМесто") Цикл
		Если Выборка.АналогичноеМесто Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Рабочее место ""%1"" используется в группе аналогичных мест ""%2""'"),
				Выборка.РабочееМесто,
				Выборка.ГруппаАналогичныхМест);
		Иначе
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Рабочее место ""%1"" используется в нескольких строках:'") + " ",
				Выборка.РабочееМесто);
			Пока Выборка.Следующий() Цикл
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '%1 %2,'"),
					ТекстОшибки,
					Выборка.НомерСтроки);
			КонецЦикла;
			СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ТекстОшибки, 1);
		КонецЕсли;
		Поле = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("РабочиеМеста[%1].%2", Выборка.НомерСтроки-1, "РабочееМесто");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , Поле, "Объект", Отказ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("РабочиеМеста", РабочиеМеста.Выгрузить());
	Запрос.УстановитьПараметр("АналогичныеМеста", АналогичныеМеста.Выгрузить());
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники.Выгрузить());
	
	// Очистим не используемые аналогичные места
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РабочиеМеста.РабочееМесто
	|ПОМЕСТИТЬ ВТРабочиеМеста
	|ИЗ
	|	&РабочиеМеста КАК РабочиеМеста
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АналогичныеМеста.РабочееМесто,
	|	АналогичныеМеста.АналогичноеМесто
	|ПОМЕСТИТЬ ВТАналогичныеМеста
	|ИЗ
	|	&АналогичныеМеста КАК АналогичныеМеста
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АналогичныеМеста.РабочееМесто,
	|	АналогичныеМеста.АналогичноеМесто
	|ИЗ
	|	ВТАналогичныеМеста КАК АналогичныеМеста
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРабочиеМеста КАК РабочиеМеста
	|		ПО АналогичныеМеста.РабочееМесто = РабочиеМеста.РабочееМесто
	|ГДЕ
	|	РабочиеМеста.РабочееМесто ЕСТЬ NULL ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныеСтроки = АналогичныеМеста.НайтиСтроки(
			Новый Структура("РабочееМесто, АналогичноеМесто", Выборка.РабочееМесто, Выборка.АналогичноеМесто));
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			АналогичныеМеста.Удалить(НайденнаяСтрока);
		КонецЦикла;
	КонецЦикла;
	
	// Очистим не используемых сотрудников
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РабочиеМеста.РабочееМесто КАК РабочееМесто
	|ПОМЕСТИТЬ ВТВсеМеста
	|ИЗ
	|	ВТРабочиеМеста КАК РабочиеМеста
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АналогичныеМеста.АналогичноеМесто
	|ИЗ
	|	ВТРабочиеМеста КАК РабочиеМеста
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналогичныеМеста КАК АналогичныеМеста
	|		ПО РабочиеМеста.РабочееМесто = АналогичныеМеста.РабочееМесто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.РабочееМесто,
	|	Сотрудники.Сотрудник
	|ПОМЕСТИТЬ ВТСотрудники
	|ИЗ
	|	&Сотрудники КАК Сотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.РабочееМесто,
	|	Сотрудники.Сотрудник
	|ИЗ
	|	ВТСотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВсеМеста КАК ВсеМеста
	|		ПО Сотрудники.РабочееМесто = ВсеМеста.РабочееМесто
	|ГДЕ
	|	ВсеМеста.РабочееМесто ЕСТЬ NULL ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НайденныеСтроки = Сотрудники.НайтиСтроки(
			Новый Структура("РабочееМесто, Сотрудник", Выборка.РабочееМесто, Выборка.Сотрудник));
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Сотрудники.Удалить(НайденнаяСтрока);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПереченьРабочихМест() Экспорт
	
	РезультатыЗапроса = ОхранаТруда.ДанныеПоРабочимМестам(Организация, ДатаНачала, ДатаОкончания);
	
	РабочиеМеста.Очистить();
	АналогичныеМеста.Очистить();
	
	Выборка = РезультатыЗапроса.Получить(РезультатыЗапроса.ВГраница() - 1).Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("РабочееМесто") Цикл
		НоваяСтрока = РабочиеМеста.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.АналогичноеМесто) Тогда
				НоваяСтрока = АналогичныеМеста.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Сотрудники.Загрузить(РезультатыЗапроса.Получить(РезультатыЗапроса.ВГраница()).Выгрузить());
	Если Комиссия.Количество() = 0 Тогда
		Комиссия.Загрузить(РезультатыЗапроса.Получить(РезультатыЗапроса.ВГраница()-2).Выгрузить());
		Если Комиссия.Количество() = 0 Тогда
			Если ЗначениеЗаполнено(Руководитель) Тогда
				НоваяСтрокаКомиссии = Комиссия.Добавить();
				НоваяСтрокаКомиссии.ЧленКомиссии = Руководитель;
				НоваяСтрокаКомиссии.Должность = ДолжностьРуководителя;
				НоваяСтрокаКомиссии.РольВКомиссии = Перечисления.РолиЧленовКомиссииОхраныТруда.Председатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(ОтветственныйЗаОхрануТруда) Тогда
				НоваяСтрокаКомиссии = Комиссия.Добавить();
				НоваяСтрокаКомиссии.ЧленКомиссии = ОтветственныйЗаОхрануТруда;
				НоваяСтрокаКомиссии.Должность = ДолжностьОтветственногоЗаОхрануТруда;
				НоваяСтрокаКомиссии.РольВКомиссии = Перечисления.РолиЧленовКомиссииОхраныТруда.ЧленКомиссии;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
